#### Terraform Plan - `prod` 🏗️
```
data.terraform_remote_state.global: Reading...
module.rds.random_password.db_password: Refreshing state... [id=none]
data.terraform_remote_state.global: Read complete after 1s
module.ecs.data.aws_region.current: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-087636c4e3d2e754d]
module.dns.aws_route53_record.frontend: Refreshing state... [id=Z00135631AKUHNYG247OE_app.airas.io_CNAME]
module.rds.aws_secretsmanager_secret.db_password: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/prod/db-password-bCqghI]
module.ecs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/airas-prod]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:427979936961:cluster/airas-prod-cluster]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-023ac8d7fbfa51ee4]
module.dns.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:ap-northeast-1:427979936961:certificate/2e86738b-5655-44d2-b031-b98df873cbbe]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04468dace6be5e55b]
module.ecs.data.aws_iam_policy_document.ecs_assume_role: Reading...
module.ecs.data.aws_iam_policy_document.ecs_assume_role: Read complete after 0s [id=1077804475]
module.ecs.aws_iam_role.ecs_task: Refreshing state... [id=airas-prod-ecs-task]
module.ecs.aws_iam_role.ecs_execution: Refreshing state... [id=airas-prod-ecs-execution]
module.dns.aws_route53_record.cert_validation["api.airas.io"]: Refreshing state... [id=Z00135631AKUHNYG247OE__215d50fa5318be12cdcecef053884352.api.airas.io._CNAME]
module.waf.aws_wafv2_web_acl.this: Refreshing state... [id=6a833fd2-e08b-4ece-8da6-a2eb06381978]
module.dns.aws_acm_certificate_validation.api: Refreshing state... [id=2026-02-25 18:43:46.099 +0000 UTC]
module.ecs.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=airas-prod-ecs-execution-20260222195708730000000002]
module.ecs.aws_ecs_task_definition.this: Refreshing state... [id=airas-prod-backend]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-064f7e5f00dc5d6b8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08e71297f193a7515]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0361bebf3e37df37c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06389a90dc8464369]
module.ecs.aws_security_group.alb: Refreshing state... [id=sg-0bdbe331bae9548f3]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-04adfe198bed5e13e]
module.ecs.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:targetgroup/airas-prod-tg/85465e38570b1276]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=airas-prod-db-subnet]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0605948f49ca561d3]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b02380d1d5e538aa]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-09ab916d6c895a030]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a4ccbbc51202ba63]
module.ecs.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:loadbalancer/app/airas-prod-alb/13ea9951b5966266]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00ba328ea68287f45]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f7d977b0dd736f05]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06403f4e78a98375f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04a9ebd3fe0e00070]
module.rds.aws_security_group.rds: Refreshing state... [id=sg-0ab09ce0bb5ed40be]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0541810add7ec916a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f720c73b6606af83]
module.rds.aws_db_instance.this: Refreshing state... [id=db-OXSP3DDAIBCFPXH2OFSNZUYSKU]
module.monitoring.aws_cloudwatch_metric_alarm.rds_connections_high: Refreshing state... [id=airas-prod-rds-connections-high]
module.monitoring.aws_cloudwatch_metric_alarm.rds_storage_low: Refreshing state... [id=airas-prod-rds-storage-low]
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=airas-prod-rds-cpu-high]
module.rds.aws_secretsmanager_secret_version.db_password: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/prod/db-password-bCqghI|terraform-20260222201219358300000009]
module.dns.aws_route53_record.api: Refreshing state... [id=Z00135631AKUHNYG247OE_api.airas.io_A]
module.ecs.aws_lb_listener.https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:listener/app/airas-prod-alb/13ea9951b5966266/c682e2df77cf1b4e]
module.monitoring.aws_cloudwatch_metric_alarm.alb_5xx: Refreshing state... [id=airas-prod-alb-5xx]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:listener/app/airas-prod-alb/13ea9951b5966266/d3bf8326bd3f69a2]
module.ecs.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:427979936961:service/airas-prod-cluster/airas-prod-backend]
module.ecs.aws_appautoscaling_target.ecs[0]: Refreshing state... [id=service/airas-prod-cluster/airas-prod-backend]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_memory_high: Refreshing state... [id=airas-prod-ecs-memory-high]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_cpu_high: Refreshing state... [id=airas-prod-ecs-cpu-high]
module.ecs.aws_appautoscaling_policy.ecs_cpu[0]: Refreshing state... [id=airas-prod-cpu-scaling]
module.waf.aws_wafv2_web_acl_association.alb: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:427979936961:regional/webacl/airas-prod-waf/6a833fd2-e08b-4ece-8da6-a2eb06381978,arn:aws:elasticloadbalancing:ap-northeast-1:427979936961:loadbalancer/app/airas-prod-alb/13ea9951b5966266]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dns.aws_acm_certificate.api will be updated in-place
  ~ resource "aws_acm_certificate" "api" {
        id                        = "arn:aws:acm:ap-northeast-1:427979936961:certificate/2e86738b-5655-44d2-b031-b98df873cbbe"
        tags                      = {
            "Name" = "airas-prod-api-cert"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-1:427979936961:service/airas-prod-cluster/airas-prod-backend"
        name                               = "airas-prod-backend"
        tags                               = {
            "Name" = "airas-prod-backend"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-prod-backend:2" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-prod-backend:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:427979936961:task-definition/airas-prod-backend" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "prod"
                        },
                    ]
                  - essential        = true
                  - image            = "427979936961.dkr.ecr.ap-northeast-1.amazonaws.com/airas-backend:prod"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/airas-prod"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "backend"
                        }
                    }
                  - mountPoints      = []
                  - name             = "backend"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "airas-prod-backend" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "Name" = "airas-prod-backend"
        }
        # (10 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role_policy.ecs_execution_secrets[0] will be created
  + resource "aws_iam_role_policy" "ecs_execution_secrets" {
      + id          = (known after apply)
      + name        = "airas-prod-ecs-secrets"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "airas-prod-ecs-execution"
    }

  # module.rds.aws_db_instance.this will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-OXSP3DDAIBCFPXH2OFSNZUYSKU"
        tags                                  = {
            "Name" = "airas-prod-postgres"
        }
        # (57 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret_version.db_password will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "db_password" {
        id             = "arn:aws:secretsmanager:ap-northeast-1:427979936961:secret:airas/prod/db-password-bCqghI|terraform-20260222201219358300000009"
        # (5 unchanged attributes hidden)
    }

  # module.rds.random_password.db_password will be updated in-place
  ~ resource "random_password" "db_password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret.app["anthropic-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/anthropic-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "ANTHROPIC_API_KEY"
          + "Name"       = "airas-prod-anthropic-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "ANTHROPIC_API_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-anthropic-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["database-url"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/database-url"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "DATABASE_URL"
          + "Name"       = "airas-prod-database-url"
        }
      + tags_all                       = {
          + "EnvVarName"  = "DATABASE_URL"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-database-url"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["enterprise-enabled"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/enterprise-enabled"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "ENTERPRISE_ENABLED"
          + "Name"       = "airas-prod-enterprise-enabled"
        }
      + tags_all                       = {
          + "EnvVarName"  = "ENTERPRISE_ENABLED"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-enterprise-enabled"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["gemini-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/gemini-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "GEMINI_API_KEY"
          + "Name"       = "airas-prod-gemini-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "GEMINI_API_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-gemini-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["gh-pat"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/gh-pat"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "GH_PERSONAL_ACCESS_TOKEN"
          + "Name"       = "airas-prod-gh-pat"
        }
      + tags_all                       = {
          + "EnvVarName"  = "GH_PERSONAL_ACCESS_TOKEN"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-gh-pat"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["langfuse-base-url"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/langfuse-base-url"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "LANGFUSE_BASE_URL"
          + "Name"       = "airas-prod-langfuse-base-url"
        }
      + tags_all                       = {
          + "EnvVarName"  = "LANGFUSE_BASE_URL"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-langfuse-base-url"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["langfuse-public-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/langfuse-public-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "LANGFUSE_PUBLIC_KEY"
          + "Name"       = "airas-prod-langfuse-public-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "LANGFUSE_PUBLIC_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-langfuse-public-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["langfuse-secret-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/langfuse-secret-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "LANGFUSE_SECRET_KEY"
          + "Name"       = "airas-prod-langfuse-secret-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "LANGFUSE_SECRET_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-langfuse-secret-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["openai-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/openai-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "OPENAI_API_KEY"
          + "Name"       = "airas-prod-openai-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "OPENAI_API_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-openai-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["qdrant-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/qdrant-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "QDRANT_API_KEY"
          + "Name"       = "airas-prod-qdrant-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "QDRANT_API_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-qdrant-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["supabase-anon-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/supabase-anon-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "SUPABASE_ANON_KEY"
          + "Name"       = "airas-prod-supabase-anon-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "SUPABASE_ANON_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-supabase-anon-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["supabase-jwt-secret"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/supabase-jwt-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "SUPABASE_JWT_SECRET"
          + "Name"       = "airas-prod-supabase-jwt-secret"
        }
      + tags_all                       = {
          + "EnvVarName"  = "SUPABASE_JWT_SECRET"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-supabase-jwt-secret"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["supabase-url"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/supabase-url"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "SUPABASE_URL"
          + "Name"       = "airas-prod-supabase-url"
        }
      + tags_all                       = {
          + "EnvVarName"  = "SUPABASE_URL"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-supabase-url"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret.app["wandb-api-key"] will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "airas/prod/wandb-api-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "EnvVarName" = "WANDB_API_KEY"
          + "Name"       = "airas-prod-wandb-api-key"
        }
      + tags_all                       = {
          + "EnvVarName"  = "WANDB_API_KEY"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "airas-prod-wandb-api-key"
          + "Project"     = "airas"
        }
    }

  # module.secrets.aws_secretsmanager_secret_version.app["anthropic-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["database-url"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["enterprise-enabled"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["gemini-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["gh-pat"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["langfuse-base-url"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["langfuse-public-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["langfuse-secret-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["openai-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["qdrant-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["supabase-anon-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["supabase-jwt-secret"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["supabase-url"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.app["wandb-api-key"] will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 30 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
*Pushed by: @fuyu-quant*